str = 'abcdefg'
print(str)
print(str[2])

# 序列[开始位置下标:结束位置下标:步长]
# 1. 不包含结束位置下标对应的数据，正负整数均可
# 2. 步长是选取间隔，正负整数均可，默认步长为1

str1 = '012345678'
print(str1[2:5:1])  # 234
print(str1[2:5:2])  # 24
print(str1[2:5])  # 234
print(str1[:5])  # 01234 -- 不写开始默认从0开始
print(str1[2:])  # 2345678 -- 不写结束默认选取到结束
print(str1[:])  # 012345678 -- 选取所有
# 负数测试
print(str1[::-1])  # 876543210 -- 步长为负数，倒叙排列
print(str1[-4:-1])  # 567 -- 下标-1表示最后一个数据，依次向前类推

# 终极测试
print(str1[-4:-1:1])  # 567
print(str1[-4:-1:-1])  # 不能选取出数据
# -4到-1选取是从左到右，而步长-1表示从右向左，所以选不出数据
# 选取方向与步长方向不一致就选不出来
print(str1[-1:-4:-1])  # 876
